<!-- -*- mode: markdown; coding: utf-8; fill-column: 60; ispell-dictionary: "english" -*- -->

<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<link rel="stylesheet" href="style.css">


# EDAF75 - lab 1: SQL

This lab is meant to be run as a `jupyter` notebook, you
could download it [here](lab1.zip) (the zip-file contains
the notebook and the database, and a [.html-file](lab1.html)
which you can read in case you have problems reading/running
jupyter notebooks).

To start your notebook, you can use the following commands
(after you've downloaded [the zip file](lab1.zip)):

```sh
unzip lab1.zip
jupyter notebook
```

This should start jupyter in a browser tab, and there you
can click "lab1.ipynb".


## Background

We have a database to handle the academic achievements of
students at LTH -- in it we have three tables:

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>students:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>social security number</td>
 </tr>
 <tr>
  <td><code>first_name</code></td>
  <td>first name (obviously!)</td>
 </tr>
 <tr>
  <td><code>last_name</code></td>
  <td>last name</td>
 </tr>
</table>

<hr>

<table rules="all">
 <tr>
  <th align="left"><code>courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>course code, like <code>EDAF75</code></td>
 </tr>
 <tr>
  <td><code>course_name</code></td>
  <td>the name of the course, like "Database Technology"</td>
 </tr>
 <tr>
  <td><code>level</code></td>
  <td>the course level, like "G1", "G2", or "A"</td>
 </tr>
 <tr>
  <td><code>credits</code></td>
  <td>the number of credits for the course, like 7.5</td>
 </tr>
</table>

<hr>

<table rules="all">
 <tr>
  <th align="left"><code>taken_courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>the social security number of a student</td>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>the course code for the course the student has taken</td>
 </tr>
 <tr>
  <td><code>grade</code></td>
  <td>the grade for the student passing the course</td>
 </tr>
</table>

<hr>

<center>
  <img src="lab1.png">
</center>

Some sample data:

```text
ssn           first_name   last_name
---           ----------   ---------
861103–2438   Bo           Ek
911212–1746   Eva          Alm
950829–1848   Anna         Nyström
...           ...          ...

course_code   course_name                   level    credits
-----------   -----------                   -----    -------
EDA016        Programmeringsteknik          G1       7.5
EDAA01        Programmeringsteknik - FK     G1       7.5
EDA230        Optimerande kompilatorer      A        7.5
...           ...                           ...      ...

ssn           course_code   grade
---           -----------   -----
861103–2438   EDA016        4
861103–2438   EDAA01        3
911212–1746   EDA016        3
...           ...           ...
```

The tables have been created with the following SQL
statements:

```sql
CREATE TABLE students (
  ssn          CHAR(11),
  first_name   TEXT NOT NULL,
  last_name    TEXT NOT NULL,
  PRIMARY KEY  (ssn)
);

CREATE TABLE courses (
  course_code   CHAR(6),
  course_name   TEXT NOT NULL,
  level         CHAR(2),
  credits       DOUBLE NOT NULL CHECK (credits > 0),
  PRIMARY KEY   (course_code)
);

CREATE TABLE taken_courses (
  ssn           CHAR(11),
  course_code   CHAR(6),
  grade         INTEGER NOT NULL CHECK (grade >= 3 AND grade <= 5),
  PRIMARY KEY   (ssn, course_code),
  FOREIGN KEY   (ssn) REFERENCES students(ssn),
  FOREIGN KEY   (course_code) REFERENCES courses(course_code)
);
```

All courses offered at the "Computer Science and
Engineering" program at LTH during the academic year 2013/14
are in the table 'courses`. Also, the database has been
filled with made up data. SQL statements like the following
have been used to insert the data:

```sql
INTO   students(ssn, first_name, last_name)
VALUES ('950705-2308', 'Anna', 'Johansson'),
       ('930702-3582', 'Anna', 'Johansson'),
       ('911212-1746', 'Eva', 'Alm'),
       ('910707-3787', 'Eva', 'Nilsson'),
       ...
```

## Assignments

As said above, this lab is designed to be run as a jupyter
notebook. If you haven't got jupyter running, you can run
the sql-commands for the problems below interactively inside
sqlite3, or as a script file with all your commands, or
inside some IDE, like [DB Browser for
SQLite](https://sqlitebrowser.org/).

If you're running the lab as a notebook (and hopefully you
are!), evaluate the following cells before you begin:

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///lab1.sqlite

The tables `students`, `courses` and `taken_courses` are
already in your database, you can see some of their contents
by running the cells below:

In [8]:
%%sql
SELECT  *
FROM    students
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'Anna', 'Johansson'),
 ('930702-3582', 'Anna', 'Johansson'),
 ('911212-1746', 'Eva', 'Alm'),
 ('910707-3787', 'Eva', 'Nilsson')]

In [5]:
%%sql
SELECT  *
FROM    courses
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('EDA016', 'Programmeringsteknik', 'G1', 7.5),
 ('EDA031', 'C++ - programmering', 'G2', 7.5),
 ('EDA040', 'Realtidsprogrammering', 'G2', 6.0),
 ('EDA050', 'Operativsystem', 'G2', 4.5)]

In [5]:
%%sql
SELECT  *
FROM    taken_courses
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'EITN35', 5),
 ('950705-2308', 'ESS050', 3),
 ('950705-2308', 'ETIN70', 4),
 ('950705-2308', 'FMA140', 4)]

If you inadvertently change the contents of the tables, you
can always recreate the them with the following command (it
must be run at the command line):

```sh
sqlite3 lab1.sqlite < lab1-setup.sql
```

After some of the questions there is a number in brackets.
This is the number of rows generated by the question. For
instance, [72] after question a) means that there are 72
students in the database, you can use that number as an
indicatation of if your answer is in the right ballpark.

a) What are the names (first name, last name) of all the
   students? [72]

In [13]:
%%sql
SELECT  first_name, last_name
FROM    students
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Johansson'),
 ('Anna', 'Johansson'),
 ('Eva', 'Alm'),
 ('Eva', 'Nilsson')]

b) Same as question a) but produce a sorted listing -- sort
   first by last name and then by first name. (When you get
   it to work, experiment by listing only the 10 first
   students, then try to list only students 11-20, etc.).

In [30]:
%%sql
SELECT  first_name, last_name
FROM    students
ORDER BY last_name, first_name
LIMIT 10
OFFSET 10

 * sqlite:///lab1.sqlite
Done.

[('Lisa', 'Berg'),
 ('Lotta', 'Bergman'),
 ('Johan', 'Brattberg'),
 ('Roger', 'Brorsson'),
 ('David', 'Carlsson'),
 ('Susanne', 'Dahl'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Karolin', 'Ek')]

c) What are the names of the students who were born in 1985?
   [4]

In [33]:
%%sql
SELECT first_name, last_name, ssn
FROM students
WHERE ssn LIKE "85%"

 * sqlite:///lab1.sqlite
Done.

[('Ulrika', 'Jonsson', '850706-2762'),
 ('Bo', 'Ek', '850819-2139'),
 ('Filip', 'Persson', '850517-2597'),
 ('Henrik', 'Berg', '850208-1213')]

d) The next-to-last digit in the social security number is
   even for females, and odd for males. List the first names
   of all female students in our database alphabetically --
   _each name should occur only once_. Hint: the `substr`
   function can be useful. [20]

In [48]:
%%sql
SELECT DISTINCT first_name, last_name, mod(substr(ssn, 10, 1), 2) as person_kind
FROM students
WHERE person_kind = 0
LIMIT 4

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Johansson', 0.0),
 ('Eva', 'Alm', 0.0),
 ('Eva', 'Nilsson', 0.0),
 ('Elaine', 'Robertson', 0.0)]

e) How many students are registered in the database?

In [342]:
%%sql
SELECT count(DISTINCT first_name)
FROM students

 * sqlite:///lab1.sqlite
Done.

[(51,)]

_Optional_: Now try to output the number of names in the
   listing in (d) using `count`. It turns out that this is a
   little bit tricky, we need to make sure we use the word
   `DISTINCT` in the right place (look carefully in the
   [documentation](https://sqlite.org/lang_aggfunc.html)).


f) Which courses are offered by the department of
   Mathematics (their course codes have the form `FMAxxx`)?
   [22]

In [81]:
%%sql
SELECT *
FROM courses
WHERE course_code LIKE "FMA%"
ORDER BY level
LIMIT 4

 * sqlite:///lab1.sqlite
Done.

[('FMA021', 'Kontinuerliga system', 'A', 7.5),
 ('FMA051', 'Optimering', 'A', 6.0),
 ('FMA111', 'Matematiska strukturer', 'A', 6.0),
 ('FMA120', 'Matristeori', 'A', 6.0)]

g) Which courses give more than 7.5 credits? [16]

In [84]:
%%sql
SELECT *
FROM courses
WHERE credits > 10.0
LIMIT 4

 * sqlite:///lab1.sqlite
Done.

[('EXTA35', 'Introduktionskurs i kinesiska för civilingenjörer', 'G1', 15.0),
 ('EXTF60', 'Introduktionskurs i kinesiska för civilingenjörer, del 2', 'G2', 15.0),
 ('FAFF25', 'Fysik', 'G2', 11.0),
 ('FMAA01', 'Endimensionell analys', 'G1', 15.0)]

h) How may courses are there for each level (`G1`, `G2`, and
   `A`)?

In [87]:
%%sql
SELECT level, count() as count
FROM courses
GROUP BY level

 * sqlite:///lab1.sqlite
Done.

[('A', 87), ('G1', 31), ('G2', 60)]

In the next few problems, we'll look at the results of the
student with the social security number 910101–1234 -- to
make things _a lot_ easier, you can create a `VIEW` with all
his results.

In [100]:
%%sql
DROP VIEW IF EXISTS student;
CREATE VIEW student AS
  SELECT *
  FROM   students
  WHERE  ssn LIKE "910101-1234";

SELECT *
FROM student

 * sqlite:///lab1.sqlite
Done.
Done.
Done.

[('910101-1234', 'Peter', 'Solberg')]

i) Which courses (course codes only) have been taken by the
   student with the social security number 910101–1234? [35]

In [143]:
%%sql
SELECT *, count()
FROM taken_courses
WHERE ssn = (SELECT ssn FROM student)
LIMIT 4

 * sqlite:///lab1.sqlite
Done.

[('910101-1234', 'EDA070', 3, 35)]

j) What are the names of these courses, and how many credits
   do they give?

In [161]:
%%sql

WITH student_taken_courses as (
  SELECT *
  FROM taken_courses
  WHERE ssn = (SELECT ssn FROM student)
)
SELECT *
FROM courses
WHERE course_code IN (SELECT course_code FROM student_taken_courses)
LIMIT 4

 * sqlite:///lab1.sqlite
Done.

[('EDA070', 'Datorer och datoranvändning', 'G1', 3.0),
 ('EDA385', 'Konstruktion av inbyggda system, fördjupningskurs', 'A', 7.5),
 ('EDAA25', 'C-programmering', 'G1', 3.0),
 ('EDAF05', 'Algoritmer, datastrukturer och komplexitet', 'G2', 5.0)]

k) How many credits has the student taken?

In [164]:
%%sql
WITH student_taken_courses as (
  SELECT *
  FROM taken_courses
  WHERE ssn = (SELECT ssn FROM student)
)
SELECT avg(grade)
FROM student_taken_courses

 * sqlite:///lab1.sqlite
Done.

[(4.0285714285714285,)]

l) What is the student’s grade average? We can calculate the
   average either just as the average of all grades
   (unweighted), or use the credits for each course as a
   weight and calculate a weighted average. Try to do the
   calculation both ways (the weighted average can be
   calculated in just one line of code, but we only require
   that you calculate the unweighted average, so don't spend
   too much time on getting the weighted average right).

In [176]:
%%sql
WITH student_taken_courses as (
  SELECT *
  FROM taken_courses
  WHERE ssn = (SELECT ssn FROM student)
)
SELECT avg(grade)
FROM student_taken_courses

 * sqlite:///lab1.sqlite
Done.

[(4.0285714285714285,)]

m) Which students have taken 0 credits? [11] This problem
   can be solved in several ways, first do it with an outer
   join:

In [257]:
%%sql
SELECT first_name, last_name
FROM students
LEFT JOIN taken_courses
USING (ssn)
GROUP BY ssn
HAVING  sum(grade) is NULL
ORDER BY first_name

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Nyström'),
 ('Bo', 'Ek'),
 ('Caroline', 'Olsson'),
 ('Erik', 'Andersson'),
 ('Erik', 'Andersson'),
 ('Filip', 'Persson'),
 ('Henrik', 'Gustavsson'),
 ('Joakim', 'Hall'),
 ('Johan', 'Lind'),
 ('Jonathan', 'Jönsson'),
 ('Magnus', 'Hultgren')]

Now do the same thing using a subquery:

In [258]:
%%sql
WITH potato as (
  SELECT ssn, sum(grade)
  FROM taken_courses
  GROUP BY ssn
)
SELECT first_name, last_name
FROM students
WHERE ssn NOT IN (SELECT ssn FROM potato)
ORDER BY first_name

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Nyström'),
 ('Bo', 'Ek'),
 ('Caroline', 'Olsson'),
 ('Erik', 'Andersson'),
 ('Erik', 'Andersson'),
 ('Filip', 'Persson'),
 ('Henrik', 'Gustavsson'),
 ('Joakim', 'Hall'),
 ('Johan', 'Lind'),
 ('Jonathan', 'Jönsson'),
 ('Magnus', 'Hultgren')]

n) List the names and average grades of the 10 students with
   the highest grade average? You can use the unweighted
   average.

In [272]:
%%sql
SELECT ssn, first_name, last_name, avg(grade) as avg_grade
FROM students
INNER JOIN taken_courses
USING (ssn)
GROUP BY ssn
ORDER BY avg_grade DESC
LIMIT 10

 * sqlite:///lab1.sqlite
Done.

[('861103-2438', 'Bo', 'Ek', 4.35),
 ('910308-1826', 'Helena', 'Troberg', 4.3076923076923075),
 ('931213-2824', 'Elaine', 'Robertson', 4.235294117647059),
 ('930702-3582', 'Anna', 'Johansson', 4.230769230769231),
 ('931208-3605', 'Ylva', 'Jacobsson', 4.21875),
 ('950705-2308', 'Anna', 'Johansson', 4.2),
 ('940801-2971', 'Mikael', 'Nilsson', 4.173913043478261),
 ('920812-1857', 'Jakob', 'Malmberg', 4.166666666666667),
 ('860819-2864', 'Maria', 'Andersson', 4.157894736842105),
 ('901030-1895', 'Per-Erik', 'Pettersson', 4.153846153846154)]

o) List the social security number and total number of
   credits for all students. Students with no credits should
   be included in the listing, with 0 credits (not `NULL`).

   If you do this with an outer join (and I recommend you
   try it!) you might want to use the function
   `coalesce(v1, v2, ...)`; it returns the first value which
   is not `NULL`, so `coalesce(avg(grade), 0)` would give 0
   if the were no grades (i.e., if `grade` were `NULL`), you
   can also try the `ifnull` function.

   (It may be a little bit tricky to get this query right,
   if you're missing the students with 0 credits, don't
   worry, your TA will help you get it right). [72]

In [300]:
%%sql
WITH potato as (
  SELECT ssn, course_code
  FROM students
  LEFT JOIN taken_courses
  USING (ssn)
)
SELECT ssn, coalesce(sum(credits), 0.0) AS credit_sum
FROM potato
LEFT JOIN courses
USING (course_code)
GROUP BY ssn
ORDER BY credit_sum DESC
LIMIT 4

 * sqlite:///lab1.sqlite
Done.

[('951004-2346', 350.0),
 ('880620-2564', 348.5),
 ('910915-2068', 338.0),
 ('920623-3258', 334.0)]

p) Do all students have unique names (first name _and_ last
   name)? If not, show the full name and social security
   number for all students who have a namesake. [7]

   As usual there are several ways of solving this, try to
   solve it using a `WITH`-statement where you create a
   table with all duplicate names, and then use it in a
   `JOIN`:

In [341]:
%%sql
WITH potato as (
  SELECT *
  FROM students
  GROUP BY first_name, last_name
  HAVING count() = 1
)
SELECT *
FROM students
WHERE ssn NOT IN (SELECT ssn FROM potato)

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'Anna', 'Johansson'),
 ('930702-3582', 'Anna', 'Johansson'),
 ('861103-2438', 'Bo', 'Ek'),
 ('931225-3158', 'Bo', 'Ek'),
 ('850819-2139', 'Bo', 'Ek'),
 ('891220-1393', 'Erik', 'Andersson'),
 ('900313-2257', 'Erik', 'Andersson')]

q) _Optional:_ List all students who have a an average grade
   higher than the average of all other students with the
   same first name. Try to use weighted averages for the
   invididual students, and compare to just the average of
   averages for the namesakes (we could have weighted their
   averages according to how many total credits they have,
   but that would be a bit over the top). Here you can use
   either a correlated subquery, or a CTE and a `JOIN`.

In [ ]:
%%sql